# Pokemon GO Spawns & Assaults in San Francisco
Dan Beaman & Hasan Sulaeman


----

## Import Dependencies

In [2]:
# Essentials
import pandas as pd
from sqlalchemy import create_engine
import pymysql

# Graphing, ended up not using this 
import folium
from folium import plugins
from folium.plugins import MarkerCluster
import matplotlib.pyplot as plt

# Settings
%matplotlib inline
pymysql.install_as_MySQLdb()

----

## Extract CSVs into Pandas Data Frames

In [26]:
# Extracting the Pokemon GO Spawn data in the Bay Area 
pokemon_file = "Resources/pokemon-spawns.csv"
pokemon_data_df = pd.read_csv(pokemon_file)
pokemon_data_df = pokemon_data_df[["name", "lat", "lng"]]
pokemon_data_df["id"] = pokemon_data_df.index 
pokemon_data_df.head()

      name        lat         lng  id
0   Weedle  37.793592 -122.408721   0
1   Pidgey  37.794746 -122.406420   1
2    Zubat  37.794999 -122.404384   2
3   Pidgey  37.795644 -122.407128   3
4  Poliwag  37.795592 -122.406331   4

In [20]:
# Extracting the police incidents data for assaults in San Francisco
police_data_df = pd.read_csv("Resources/police-department-incidents.csv")
police_data_df = police_data_df[["IncidntNum", "Descript", "PdDistrict", "Resolution", "X", "Y"]]
police_data_df.head()

,IncidntNum,Descript,PdDistrict,Resolution,X,Y
0,50436712,BATTERY,MISSION,NONE,-122.435003,37.760888
1,130366639,AGGRAVATED ASSAULT WITH A KNIFE,INGLESIDE,"ARREST, BOOKED",-122.444707,37.724931
2,141024103,"CHILD, INFLICTING INJURY RESULTING IN TRAUMATI...",MISSION,"ARREST, BOOKED",-122.407102,37.762558
3,51142198,THREATS AGAINST LIFE,CENTRAL,"ARREST, BOOKED",-122.403847,37.789828
4,140684794,BATTERY,BAYVIEW,NONE,-122.402554,37.765419

----

## Data Exploration

In [48]:
# For the police data. Data's too large, don't run this. Code works though if you subset. 
## Create a map using the lat-long of the 
m = folium.Map([37.745644, -122.407128],tiles = "Stamen Terrain", zoom_start=12, control_scale=True)

## Convert the lat-long cell type to floats
police_data_df['Y'] = police_data_df['Y'].astype(float)
police_data_df['X'] = police_data_df['X'].astype(float)

assaults = folium.FeatureGroup(name = 'Assaults')
for i in range(0,len(police_data_df)):
    assaults.add_child(folium.Marker([police_data_df.iloc[i]['Y'], \
    police_data_df.iloc[i]['X']], popup=str(police_data_df.iloc[i]['IncidntNum'])))   
m.add_child(assaults)
m.add_child(folium.map.LayerControl())

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

----

### Transform Pokemon DataFrame

In [35]:
# Not much to change. Just doing some QC
pokemon_data_df.drop_duplicates("id", inplace=True)
pokemon_data_df.set_index("id", inplace=True)
pokemon_data_df = pokemon_data_df.dropna()
# look at the head
pokemon_data_df.head()

       name        lat         lng
id
0    Weedle  37.793592 -122.408721
1    Pidgey  37.794746 -122.406420
2     Zubat  37.794999 -122.404384
3    Pidgey  37.795644 -122.407128
4   Poliwag  37.795592 -122.406331

### Transform Assault Incidents DataFrame

In [21]:
# Change column names for new_police_df
police_data_df.rename(columns={'IncidntNum':'inc_num',
    'Descript':'descr',
    'PdDistrict':'district',
    'Resolution':'resolution',
    'X':'lng',
    'Y':'lat'}, 
    inplace=True)
police_data_df.drop_duplicates("inc_num", inplace=True)
police_data_df.set_index("inc_num", inplace=True)
police_data_df = police_data_df.dropna()
police_data_df.head()

,descr,district,resolution,lng,lat
inc_num,,,,,
50436712,BATTERY,MISSION,NONE,-122.435003,37.760888
130366639,AGGRAVATED ASSAULT WITH A KNIFE,INGLESIDE,"ARREST, BOOKED",-122.444707,37.724931
141024103,"CHILD, INFLICTING INJURY RESULTING IN TRAUMATI...",MISSION,"ARREST, BOOKED",-122.407102,37.762558
51142198,THREATS AGAINST LIFE,CENTRAL,"ARREST, BOOKED",-122.403847,37.789828
140684794,BATTERY,BAYVIEW,NONE,-122.402554,37.765419

----
## Create database connection

In [30]:
# rds_connection_string = "root:<password>@127.0.0.1/customer_db"
# engine = create_engine(f'mysql://{rds_connection_string}')
engine = create_engine(f'mysql://root:indigomaster@127.0.0.1/pokemon_police_db')

In [39]:
# Confirm tables
engine.table_names()

['pokemon', 'police']

----
## Load DataFrames into SQL

In [44]:
# Loading the data frames into SQL
pokemon_data_df.to_sql(name='pokemon', con=engine, if_exists='append')
police_data_df.to_sql(name='police', con=engine, if_exists='append')

In [46]:
pd.read_sql_query('select * from pokemon', con=engine).head()

   id     name        lat         lng
0   0   Weedle  37.793592 -122.408721
1   1   Pidgey  37.794746 -122.406420
2   2    Zubat  37.794999 -122.404384
3   3   Pidgey  37.795644 -122.407128
4   4  Poliwag  37.795592 -122.406331

In [48]:
pd.read_sql_query('select * from police', con=engine).head()

,inc_num,descr,district,resolution,lng,lat
0,50436712,BATTERY,MISSION,NONE,-122.435003,37.760888
1,130366639,AGGRAVATED ASSAULT WITH A KNIFE,INGLESIDE,"ARREST, BOOKED",-122.444707,37.724931
2,141024103,"CHILD, INFLICTING INJURY RESULTING IN TRAUMATI...",MISSION,"ARREST, BOOKED",-122.407102,37.762558
3,51142198,THREATS AGAINST LIFE,CENTRAL,"ARREST, BOOKED",-122.403847,37.789828
4,140684794,BATTERY,BAYVIEW,NONE,-122.402554,37.765419